# DATA SCIENCE SESSIONS VOL. 3
### A Foundational Python Data Science Course
## Session 10 - part 2: Relational Databases and Pandas 

[&larr; Back to course webpage](https://datakolektiv.com/)

Feedback should be send to [goran.milovanovic@datakolektiv.com](mailto:goran.milovanovic@datakolektiv.com). 

These notebooks accompany the DATA SCIENCE SESSIONS VOL. 3 :: A Foundational Python Data Science Course.

### Lecturers

[Goran S. Milovanović, PhD, DataKolektiv, Chief Scientist & Owner](https://www.linkedin.com/in/gmilovanovic/)

[Aleksandar Cvetković, PhD, DataKolektiv, Consultant](https://www.linkedin.com/in/alegzndr/)

[Ilija Lazarević, MA, DataKolektiv, Consultant](https://www.linkedin.com/in/ilijalazarevic/)

***

## Relational Databases

Relational database is a way of organizing (designing) data into tables where each table is in some way related to the other(s). This is where the 'relational' part is comming from. Plain and simple! 

But what is a database? In general, a database is a way of organizing the data. Relational database is just one of many types of databases.  

Database management system is a software that provides service for storing, updating, and retrieving the data from the database. Additionally, it provides many functionalities that make your life as user, a pleasant experience. There are functionalities that are particularly exposed to the special type of users called **DBA** (*Database Administrator*). These special functionalities are mostly non of the concern for regular users who want to perform **CRUD** (*Create, Read, Update, Delete*) operations. Yet, for any serious use of databases, you need an administrator. 

Since there are many types of databases, when we talk about relational ones, we talk about RDBMS (*Relational Database Management System*). **MariaDB** is one of these. Some others that you may have heard are *Oracle*, *Postgres*, *Microsoft Access*, *MySQL*, *SQLite*, *MongoDB*, *ElasticSearch*, etc. Some are relational, some are non-relational. Which one you are going to use reallly boils down to the business requirements and use cases.

Relational approach to designing databases was invented in 1970s, but **Edgar Frank "Ted" Codd**. Previously used hierarchical and network databases had cons outweighting the pros in regard to modern times and modern use cases. This is where relational databases came and excelled. Along with the relational database design came a need to standardize a way of dealing with data in database system. This is when **SEQUEL** (*Structured English Query Language*) language was invented. However, it was shortly renamed to **SQL** (*Structured Query Language*). This is what we will be using later. Anyway, because SQL was so popular it became a synonum for relational databases. So much that non-relational databases are also called **NoSQL** databases.

In this session we will be using **MariaDB** as RDBMS, and **SQL** to query data from the database and tables you hopefully have created by now.

Because we are going to introduce a new language and a ways of querying and processing the data, we have decided to use alredy known NYC Flights data set. You are already familiar with it, so we can solely focus on learning new concepts.

Alright then, let's start.

### Setup

In [ ]:
import os
data_dir = os.path.join(os.getcwd(),'_data')

In [ ]:
import warnings

warnings.filterwarnings("ignore")

In [ ]:
import numpy as np
import pandas as pd

from sqlalchemy import create_engine
from sqlalchemy import text as sql_text

SQLAlchemy is a powerful tool that allows Python developers to work with databases in a more productive way, without sacrificing performance or flexibility. It is widely used in web development, data science, and other fields where data management is critical. SQLAlchemy allows developers to interact with databases in a more Pythonic way, using Python objects and syntax to represent database tables, rows, and queries. This makes it easier to write database code that is both more intuitive and more maintainable.

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df_airlines = pd.read_csv(os.path.join(data_dir, 'airlines.csv'), index_col=0)
df_flights = pd.read_csv(os.path.join(data_dir, 'flights.csv'), index_col=0)
df_weather = pd.read_csv(os.path.join(data_dir, 'weather.csv'), index_col=0)
df_airports = pd.read_csv(os.path.join(data_dir, 'airports.csv'), index_col=0)
df_planes = pd.read_csv(os.path.join(data_dir, 'planes.csv'), index_col=0)

In [ ]:
df_airlines.shape, df_flights.shape, df_weather.shape, df_airports.shape, df_planes.shape

### Connect to MariaDB: an RDBS running on your local host

Like we said, **MariaDB** is a RDBMS, and you can view it a as program that runs on your host. Since it runs without particular window, you will not be able to "see" it, but it still runs. Because you mostly work with windows, be it Windows, MacOS, Linux or any other, you are acustomed to User Interface (UI). Because this program runs "invisibly" we need a way of communicating with it. Since program is "listening" on a specific address and port, we have to specify this "full address" if we are to connect to it. This "full address" is specified in the next string.

In [ ]:
CONNECTION_STRING = 'mysql+mysqlconnector://datakolektiv:datakolektiv123@localhost/nycflights'

The `CONNECTION_STRING` typically includes the following information:

- The **database driver**: The driver defines the type of database being used, such as MySQL, PostgreSQL, SQLite, etc.
- The **username and password**: These are the credentials that are required to connect to the database server.
- The **server address**: This is the hostname or IP address of the server where the database is located.
- The **port number**: This is the port number used by the database server to communicate with clients.
- The **database name**: This is the name of the database that you want to connect to.

Here's a breakdown of the components of this particular CONNECTION_STRING:

- `mysql+mysqlconnector`: This specifies the database driver to use, which is MySQL Connector/Python in this case.
- `datakolektiv:datakolektiv123`: These are the username and password, respectively, used to authenticate with the database.
- `localhost`: This is the server address where the database is located. In this case, it is the same machine where the Python code is running.
- `nycflights`: This is the name of the database to connect to.

Now we have to create an `Engine` object that will know how to speak with our database. It will give us ability to connect to our database and "speak" with it.

In [ ]:
# MariaDB is a successor of the MySQL 
# and that is the reason why you will see
# we use mysql when connecting to the 
# database.
engine = create_engine(CONNECTION_STRING) # use this as is

Since there are couple of steps when "talking" with the database, we will hide them behing this helper function.

In [ ]:
def query_database(query: str, chunked: bool = False) -> pd.DataFrame:
    conn = engine.connect()  # necessary to start querying the database
    chunk_size = 10_000 if chunked is True else None
    df = pd.read_sql_query(sql=sql_text(query), con=conn, chunksize=chunk_size)
    conn.close()  # necessary to say that you are finished with querying
    return df

Here is an overview of what the `query_database` functions does:

- `def query_database(query: str, chunked: bool = False) -> pd.DataFrame`: this is a function definition that takes two parameters, a SQL query string and a boolean flag indicating whether or not to read the results in chunks. It returns a Pandas DataFrame.
- `conn = engine.connect()`: establishes a connection to the database using the SQLAlchemy engine object engine.
- `chunk_size = 10_000 if chunked is True else None`: sets a chunk size for reading results from the database if chunked parameter is True, otherwise it sets chunk_size to None.
- `df = pd.read_sql_query(sql=sql_text(query), con=conn, chunksize=chunk_size)`: this line reads the results of the SQL query from the database into a Pandas DataFrame using the `pd.read_sql_query()` method. The `sql_text()` function from SQLAlchemy is used to convert the query parameter to an SQL expression.
- `conn.close()`: closes the connection to the database, indicating that the query is complete and resources can be released.
- `return df`: returns the resulting Pandas DataFrame containing the data retrieved from the database.

You already tested the database in the preparation notebook for this session. However, let's test it once more.

In [ ]:
query_database('SELECT * FROM flights LIMIT 10')

### SQL Language

Like we said in introduction part, we need a way to talk with database. A language to say. **That language is SQL**. 

#### A sample SQL query

SQL, like any other programming language has it's own syntax. Here is an example:

```sql
SELECT weather.*,
       flights.carrier,
       flights.origin AS ORG,
       MAX(distance) AS dist,
       SUM(dep_time),
       AVG(air_time),
  FROM flights AS f
  LEFT JOIN airlines as a
    ON f.carrier = a.carrier
 WHERE f.carrier = 'UA' 
   AND f.dest IN ('IAH', 'MIA', 'FLL')
   AND f.origin != 'EWR'
   AND f.month BETWEEN 5 AND 10
 GROUP BY f.year, f.month
 ORDER BY dist
```

This query example may not make much sense, but it is an example of the syntax and some of the most used keywords.

Here is how [ChatGPT](https://openai.com/blog/chatgpt) explains this query:

This SQL query selects data from two tables, weather and flights, and combines them using a LEFT JOIN. The goal is to gather information about United Airlines (carrier code 'UA') flights from certain airports to specific destinations during certain months.

Here's a breakdown of what each part of the query does:

- `SELECT weather.*, flights.carrier, flights.origin AS ORG, MAX(distance) AS dist, SUM(dep_time), AVG(air_time)`: This line specifies the columns that should be returned in the query result. The `weather.*` selects all columns from the `weather` table, and then additional columns are selected from the `flights` table. The `MAX(distance)` function selects the maximum value of the distance column, `SUM(dep_time)` calculates the sum of dep_time column, and `AVG(air_time)` calculates the average of `air_time` column.

- `FROM flights AS f LEFT JOIN airlines as a ON f.carrier = a.carrier`: This line specifies the tables being queried and how they should be joined. The `flights` table is aliased as `f`, and then a `LEFT JOIN` is performed to the `airlines` table, which is aliased as `a`. The `ON` clause specifies that the join should be made where the `carrier` column in the `flights` table matches the `carrier` column in the `airlines` table.

- `WHERE f.carrier = 'UA' AND f.dest IN ('IAH', 'MIA', 'FLL') AND f.origin != 'EWR' AND f.month BETWEEN 5 AND 10`: This line filters the data being queried. The `WHERE` clause specifies that the `carrier` column in the `flights` table must be `'UA'`, the `dest` column must be one of the three airport codes specified, the `origin` column cannot be `'EWR'`, and the `month` column must be between May and October (inclusive).

- `GROUP BY f.year, f.month`: This line groups the query results by the `year` and `month` columns of the `flights` table. This means that the resulting data will be grouped by the `year` and `month` of each flight.

- `ORDER BY dist`: This line orders the query result by the `dist` column (the maximum distance of each group) in ascending order.

Overall, this query returns a result set that contains weather information and aggregated data about United Airlines flights departing from certain airports to specific destinations during certain months. The result set is grouped by year and month, and the data is ordered by the maximum distance of each group.

We will go thorugh the examples of querying database and also display how we can achieve same thing, or at least similar, in Pandas.

#### Selecting

In [ ]:
query_database('SELECT * FROM airlines')

All of our queries will start with keyword `SELECT`. By this we are saying that we want to read the data. Then, there is the `FROM` keyword followed by the table name, that says where are we reading the data from. `*` is part where we "select" all columns data to be present in the query result. This part where we select what do we want to appear in the query result is very interesting, as we shall see. For now, know that we can select all columns (`*`) or specific ones by specifying each column's name.

Let's go through some simple examples of querying our tables.

Retrieve all columns and rows from table airlines ordered by name ascendingly.

In [ ]:
query_database('SELECT * FROM airlines ORDER BY name ASC')

# Pandas way
# df_airlines.sort_values(by='name', ascending=True)

How about we select all rows but only *carrier* column, and still keep rows sorted ascendingly by the *name* column?

In [ ]:
query_database('SELECT carrier FROM airlines ORDER BY name ASC')

# Pandas way
# df_airlines.sort_values(by='name', ascending=True).loc[:, ['carrier']]

We can also select both columns, explicitly. It is easier to use `*` instead of explicit column names, particularly when there is a lot of columns and you need them all. Nevertheless, it may be helpful for ones reading your SQL query to know what will be the result without looking at the result itself.

In [ ]:
query_database('SELECT carrier,name FROM airlines ORDER BY name')

Let's do a similar thing but now sort rows by *carrier* column descendingly.

In [ ]:
query_database('SELECT * FROM airlines ORDER BY carrier DESC')

But what if the desired colum name is not to your liking? Can we change it in SQL? Yes!

In [ ]:
query_database('SELECT carrier AS airlane_code, name AS airlane_name FROM airlines ')

Keyword `AS` in `SELECT` and `FROM` sections is used for giving substitute name. This substitute name is also called **alias**. 

You can create alias (new name) for particular database object. For example, you can use `AS` for column or table aliasing. In previous example we did create alias for both columns.

Nice. To bad you can't query Pandas DataFrames with SQL, right? Wrong. Apparently, there is an initiative for doing exactly this. Check [it](https://fugue-tutorials.readthedocs.io/index.html) out!

#### Filtering

What if we want to filter rows by some condition? Here in our table we only have columns of type string. Let's fetch only rows where *carrier* is equal to 'AA'.

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier = "AA"')

What if we want to take all rows where *carrier* starts with 'A'?

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier LIKE "A%"')

Above example with **=** is exact comparison, while the example with **LIKE** leaves you the option of using ... *wildcards* characters.

What is the *wildcard* character? It is used as the substitution (replacement) for one or multiple characters. We could go into more technical details here, but it is certainly better to show this on few examples.

Let's first go over given alternatives.

| Wildcard | Description|
|------|-----|
| % | Replaces string of zero or more characters. |
| _ | Replaces one character. |

By now you are certainly confused.

Examples!

In [ ]:
query_database('SELECT * FROM airlines WHERE name LIKE "Air%"')

What is happening here? Query fetches only rows for which value of *name* column **starts with 'Air'**. `%` specifies that we do not care what goes after 'Air' i.e. all strings that start with 'Air' pass this condition (Air**Tran**, Air**lines**, Air**ways**, etc.).

But how come we did not retrieve more rows? Well, by specifying `Air%` we only get rows where *name* string starts with **Air**.

If we want to retrieve rows where *name* contains **Air** we should do it like in next example:

In [ ]:
query_database('SELECT * FROM airlines WHERE name like "%Air%"')

# Pandas way
# df_airlines[df_airlines.name.str.contains('Air')]

What if we want to retrieve rows where *name* contains separate word **Air**?

In [ ]:
query_database('SELECT * FROM airlines WHERE name LIKE "%_Air_%"')

#df_airlines[df_airlines.names.str.contains(' Air ')]

What if we want to make another condition and take rows where *name* contains separate word **Air** and separate word **Inc.**?

In [ ]:
query_database('SELECT * FROM airlines WHERE name LIKE "% Air %"  AND name LIKE "% Inc %"')

String matching **is not case sensitive**. 'a' == 'A'. Pay attention to this.

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier = "aa"')

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier LIKE "_a"')

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier LIKE "a_"')

What if we want to filter out based on `LIKE` condition, instead of selecting?

We use **NOT** keyword i.e. **NOT LIKE** instead of **LIKE**.

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier NOT LIKE "a_"')

In [ ]:
query_database('SELECT * FROM airlines WHERE carrier NOT LIKE "a_" AND name NOT LIKE "%Inc."')

Surely, this is getting harder to read and can get really painful if you keep adding more keywords into SQL query string. 

Let's try writing SQL queries for easier reading.

In [ ]:
query_string = '''
SELECT * FROM airlines 
 WHERE carrier NOT LIKE "a_" 
   AND name NOT LIKE "%Inc."
'''

query_database(query_string)

Some of the examples do not have Pandas way, but we encourage you to try it in Pandas and develop your Pandas skills along the way.

Let's switch table.

In [ ]:
query_database('SELECT * FROM weather')

#### Distinct values and counting

Can we get the distinct values in desired column?

In [ ]:
query_database('SELECT DISTINCT(origin) FROM weather')

Oh, first thing that stands out are *NaN* values. But how do we filter these out?

In [ ]:
query_string = '''
SELECT  * FROM weather
WHERE wind_gust IS NOT NULL;
'''

In [ ]:
query_database(query_string)

In [ ]:
#with using pandas

df_weather['wind_gust'].dropna()

**Remember**: `NaN` in Pandas is `NULL` in SQL.

Do you want to know the number of rows that contain *NaN* value in *wind_gust*?

In [ ]:
query_string='''
SELECT COUNT(*) AS num_nulls
FROM weather
WHERE wind_gust IS NULL
'''

In [ ]:
query_database(query_string)

Nice!

What about more conditions for filtering rows?

In [ ]:
query_string='''    
SELECT *  FROM weather
WHERE month BETWEEN 5 and 10
'''

In [ ]:
query_database(query_string)

In [ ]:
query_string  ='''  
SELECT * FROM weather
WHERE month IN (4,5,6)
'''

In [ ]:
query_database(query_string)

Yeah, you must be thinking we should go straight to the 'relational' part and start joining tables. We will get to there. But first, let's play a little with simpler queries.

When we talk about *SQL* there is **THE** standard that specifies strict syntax rules, keywords that must exist, supported wildcards, functions, procedures and so on. However, each RDBMS implements it's own **SQL dialect**. In that sense, even MariaDB is not fully compatibile with *SQL* standard, and *SQL* written for other database system e.g. Oracle, may not work on MariaDB out of the box. Have that in mind when searching through the documentation and Internet.

#### Limiting
Let's look at the `weather` data set.

In [ ]:
df_weather.head()

Interestingly enough, we just called `head()` method and did not show how to achieve a similar result with *SQL*.

It is by using `LIMIT` keyword.

Now, the reasons why you would like to use `LIKE` are probably not quite the same as the reasons for using `head()` on a Pandas DataFrame.

You see, the chances of having a Pandas DataFrame with millions of rows are slim to none. Even then, the DataFrame is displayed by showing the first and last dozen rows.

When querying a database system, you have to be careful when trying to retrieve all rows. If you do not put a limit on your query response, you will try to **fetch** all rows. This can be time consuming or very costly, depending on the database, hosting, etc.

So, in the phases of exploring the data, before you are 100% sure of what you are doing, use `LIMIT`. Always.

We will not use it in this session since the size of the largest data set (table) is not that big.

In [ ]:
query_database('SELECT * FROM weather LIMIT 5')

In [ ]:
query_database('SELECT * FROM weather ORDER BY origin DESC LIMIT 5')

This example shows when `LIMIT` keyword is "executed". 

You may believe that we first take 5 first rows, and then do the sort. However, this is not the case. Executing `LIMIT` comes at the end, when the data is sorted.

#### Casting

Okay, let's retrieve only temperature column from the *weather* table. But! Let's retrieve it as integer. 

RDBMS implement various functions that you can call. One of these is `CAST` for casting. Think of casting as converting.

In [ ]:
query_string = '''
SELECT CAST(temp AS INT) AS temp
  FROM weather
'''

_df = query_database(query_string)
_df

In [ ]:
query_string = '''   
SELECT CAST(temp AS INT) AS temp
FROM weather
'''

In [ ]:
_df= query_database(query_string)
_df

These are floats and we expect integers. What is happening?

Do we have the `NaN` values and Pandas converts it to `float64` type?

In [ ]:
_df.isna().value_counts() 

# 2 NaN

In [ ]:
_df.info()

In [ ]:
_df[_df.temp.isna()] # 2 NaN

Can we deal with this?

In [ ]:
query_string = '''
SELECT CAST(temp AS INT) 
  FROM weather
 WHERE temp IS NOT NULL
'''

query_database(query_string)

Ah, now it is giving us the result. 

So, the conclusion must be that *NULL* from database ends up as *NaN* in Pandas? Well, not quite. You will see in the examples below.

#### Math

What other functions can we use? Are there math functions? String functions?

Let's try couple of examples for each.

In [ ]:
query_string = '''   
SELECT(temp-32) * 5/9 AS temp_C,
temp AS temp_f,
FLOOR(temp) AS temp_fi,
FORMAT(temp,5) AS temp_fif
FROM weather
WHERE temp IS NOT NULL
'''

_df= query_database(query_string)
_df

What did we expect here? Let's go over the columns we created in the query:
- `(temp - 32) * 5/9 AS temp_c` - here we convert Farenheits to Celsius and name column as *temp_c*,
- `temp AS temp_f` - just using the *temp* column, but renaming it with *temp_f*. This renaming is is not perserved in table. It's just for the resulting data that we get as the result of querying.
- `FLOOR(temp) AS temp_fi` - *FLOOR* is the function that rounds float number to the biggest integer smaller than actual value.
- `FORMAT(temp, 5) AS temp_fif` - *FORMAT* is a little bit like f-string formatting in Python. Here we just say to round float number to 5 decimal places.

You must be thinking, `FLOOR` returned float and not integer. You are right. What is happening here?

In [ ]:
_df.info()

Huh, Pandas is having hard time recognizing column types.

For example *temp_fi* colum is converted to `np.float64` and it should be of `np.int` type.

Are there any *NULL* values in `temp` column in *weather* table?

In [ ]:
query_string = '''
SELECT (temp - 32) * 5/9 AS temp_c, 
       temp AS temp_f,
       FLOOR(temp) AS temp_f_i 
  FROM weather
 WHERE temp IS NULL
'''

_df = query_database(query_string)
_df

Apparently, there is one row where `temp` is *NULL*. Calling any math function on *NULL* returns *NULL*.

But why we have *None* instead of Python's *NaN*?

If we inspect data types of columns in DataFrame, you will see that these are recognized as *object*.

In [ ]:
_df.info()

In [ ]:
type(_df.iloc[0, 0])

Apparently, Pandas tries to convert column to adequate data type. If there are integers and *NULL* values in the column, it will be recognized as *np.float* data type, and *NULL* will be converted to *np.NaN*. 

However, if there are only *NULL* values in column, then Pandas leaves them as Python's *NoneType*. 

Best advice here would be to pay attention and make sure you deal with MariaDB *NULL* values properly in Pandas.

More math functions.

The integer division is performed with `DIV` operator.

In [ ]:
query_string = '''
SELECT temp DIV 1
  FROM weather
 WHERE temp IS NOT NULL
'''

_df = query_database(query_string)
_df

This gives us the result we wanted with `FLOOR` function. Right? Wrong! Try dividing negative number and compare with calling `FLOOR` function on it too.

In [ ]:
query_string = ''' 
SELECT temp DIV -1
FROM weather
WHERE temp IS NOT NULL
'''

_df = query_database(query_string)
_df

In [ ]:
query_database('SELECT FLOOR(-3.4)')
#closest lowest INT

Fortunately, we have `CEIL` as opposite of `FLOOR`. It rounds to the smallest integer bigger than the actual value.

In [ ]:
query_database('SELECT CEIL (-3.4)')

#smallest bigger - 3 > -4




And what about the remainder of the division?

In [ ]:
query_string = '''     
SELECT temp MOD 1
FROM weather
WHERE temp IS NOT NULL
'''

_df=query_database(query_string)
_df

Not a problem. There is `LPAD` function that we can use. It has 3 arguments: number to pad, overall spaces and a character to use for padding.

In [ ]:
query_string = '''
SELECT LPAD(day, 5, 0) 
  FROM weather
'''

_df = query_database(query_string)
_df

Neat!

Make sure you check out MariaDB math functions documentation [page](https://mariadb.com/kb/en/numeric-functions/).

#### Strings

Let's go through some string functions.

Just a little overview of `weather` data set.

In [ ]:
df_weather.head()

Let's concatenate *year*, *month* and *day* to form human friendly date e.g. `2023-04-01`.

In [ ]:
query_string = '''      
SELECT CONCAT(year,"-", LPAD(month,2,0),"-", LPAD(day,2,0)) AS date_humanize,
    year,
    month,
    day
FROM weather
'''

In [ ]:
query_database(query_string)

Let's use another table with more interesting string columns.

In [ ]:
df_airports.head()

Next example will include couple of `string functions` in MariaDB.

In [ ]:
query_string = '''      
SELECT name,
     INSTR(name, "airport") AS contains_airport, 
    SUBSTRING_INDEX(name, " ", 1),
    REVERSE(SUBSTRING_INDEX(name, " ", 1))
 FROM airports
 LIMIT 5
'''
_df = query_database(query_string)
_df

### INSTR  - function return position of argument in the string 

**INSTR(str,substr)**

name = "Luka"

INSTR(name,'ka")

output: 2

name_ 1 = "It's amazing world"

INSTR(name_1, "zi")

output: 9

...

INSTR() performs a case-insensitive search.

If any argument is NULL, returns NULL.


### SUBSTRING_INDEX - Returns the substring from string str before count occurrences of the delimiter delim. 

**SUBSTRING_INDEX(str,delim,count)**

SUBSTRING_INDEX('www.mariadb.org', '.', 2)

output: www.mariadb

***

> DataKolektiv explanation:

What is happening here? We will explain column by column:
- *name* - just a table column that exists in databse.
- *contains_airport* - we get this by calling `INSTR` function. It searches for "Airport" string in corresponding cell in *name* column. If it is found, it's position is returned. Counting starts with 1, because 0 is reserved when "Airport" is not found.
- `SUBSTRING_INDEX(name, " ", 1)` - we get this by calling `SUBSTRING_INDEX` function on *name* column. This returns the substring from *name* before count occurrences (1) of the delimiter (" "). 
- `REVERSE(SUBSTRING_INDEX(name, " ", 1))` - this is just the reversed string we have from the previous column.

There is more string functions so make sure you check out MariaDB string functions documentation [page](https://mariadb.com/kb/en/string-functions/).

There are even date, time and date/time functions.

We will use *weather* table again.

#### Dates

There are even date, time and date/time functions.

We will use *weather* table again.

In [ ]:
df_weather.head()

We have *year*, *month* and *day* columns. Let's create a *date* column.

In [ ]:
query_string = '''      
SELECT CONCAT(year,"-", LPAD(month,2,0),"-", LPAD(day,2,0)) AS date
FROM weather
'''

_df= query_database(query_string)
_df

This is painful and slow to do. Let's use datetime functions.

In [ ]:
query_string = '''      
SELECT GET_FORMAT(DATE, "ISO")
'''
query_database(query_string)

This is also posible. We are just running a function, and not querying any table.

In [ ]:
query_string = '''
SELECT year, 
       month, 
       day, 
       DATE_FORMAT(time_hour, GET_FORMAT(DATE, 'ISO'))
  FROM weather
'''

query_database(query_string)

Make sure you check out MariaDB date and time functions documentation [page](https://mariadb.com/kb/en/date-time-functions/).

There is certainly more to using and combining available functions. Feel free to experiment. You can do a lot of preprocessing in database. Think about why would you like to do it in database and not in Pandas.

Now, let's start learning some new SQL keywords and uses.

#### Joining tables

We already said that relational databases are widely known and successful because data is structured in tables so that it can be easily managed. 

Still, data split in tables has to be merged by joining. 

In Pandas we used `pd.merge`. In *SQL* we use `JOIN` keyword. And couple of following ones.

Before we dive into *SQL* part, let's quickly refresh our understanding on **joining**.

Like we said in one of the previous sessions, joins can be *mutating* and *filtering*.

We dfferentiated between 4 types of *mutating* joins:
- **inner join** - returns records that have matching values in both tables,
- **left (outer) join** - returns all records from the left table and right table records that have matching values,
- **right (outer) join** - returns all records from the right table and left table records that have matching values,
- **full (outer) join** - returns records from both tables regardless of maching values.

MariaDB **doesn't support *FULL OUTER JOIN***.

"Filtering joins" are not joins per se, although we can do it the same way we did it with Pandas.


[Here](https://bookdown.org/pdr_higgins/rmrwr/mutating-joins-to-combine-data-sources.html) you can find nicely presented different types of joins.

Once again, we will check out relational model of our data set [here](https://jrnold.github.io/r4ds-exercise-solutions/relational-data.html#exercise-13.2.2).

In [ ]:
df_airports.head()

In [ ]:
df_weather.head()

In [ ]:
df_airports.shape, df_weather.shape

In this data set, weather parameters were measured hourly for each airport. Based on this, we can join *weather* and *airport* tables.

In [ ]:
query_string = '''      
SELECT * 
FROM airports
JOIN weather
ON airports.faa = weather.origin
'''

query_database(query_string)

The join is performed - > left on airports['faa'] column and right on weather['origin] column

Pandas way will be done like this:

In [ ]:
pd.merge(df_airports,df_weather, how='right', right_on='origin',left_on='faa')

select *

FROM airports

JOIN weather

ON airports.faa = weather.join

Let's select subset of all columns we have when performing the joining.

Pay close attention to the aliases we are using. By introducing "*w*" alias for *weather* table, we have to use if to reference desired columns.

Also, notice how we switched tables places. Now we do the *left join* of *airports* on *weather* table. Previously we perform *inner join*.

In [ ]:
query_string  = '''     
SELECT w.origin,
    w.temp,
    w.dewp,
    w.humid,
    a.lat
FROM weather AS w
LEFT JOIN airports AS a
ON a.faa = w.origin
'''

query_database(query_string)

What about doing the same thing in Pandas?

In [ ]:
df_1 = pd.merge(df_weather[['origin','temp','dewp','humid','time_hour']], df_airports[['faa','name']], how='left', left_on='origin',right_on='faa')
df_1

Now to the **RIGHT JOIN**. The principle is the same as with **LEFT JOIN**.

In next example we are just switching places of table names in query.

How about we start formatting our *SQL* for easier reading?

``` sql
    SELECT w.origin, 
           w.temp, 
           w.dewp, 
           w.humid, 
           w.time_hour, 
           a.name 
      FROM airports AS a
RIGHT JOIN weather AS w
        ON w.origin = a.faa
```

In [ ]:
query_string = '''   
SELECT w.origin,
w.temp,
w.dewp,
w.humid,
w.time_hour,
a.name
FROM airports AS a
RIGHT JOIN weather as W
on w.origin = a.faa
'''

query_database(query_string)

Like we said, using `RIGHT JOIN` is the same as using `LEFT JOIN` with changing the tables names in query, of course.

Interesting overview could be to have table that contains abbreviations for origin and destination airports, along with their full names.

How can we write query for that?

We will do it in next steps:
 - "take" *flights* table and left join *airports* on *orign* and *faa* columns, respectively.
 - then left join *airports* table with *flights* again, this time on *faa* and *dest* respectively.
 - take desired columns to be the result of the query, along with introducing 2 aliases.

 Check it out:

```sql
     SELECT flights.origin, 
            origin_airports.name AS origin_airport_name,
            flights.dest, 
            dest_airports.name AS dest_airport_name,
            flights.carrier
       FROM flights
  LEFT JOIN airports AS origin_airports
         ON flights.origin = origin_airports.faa 
  LEFT JOIN airports AS dest_airports
         ON flights.dest = dest_airports.faa
```

In [ ]:
query_string = '''
     SELECT flights.origin, 
            origin_airports.name AS origin_airport_name,
            flights.dest, 
            dest_airports.name AS dest_airport_name,
            flights.carrier
       FROM flights
  LEFT JOIN airports AS origin_airports
         ON flights.origin = origin_airports.faa 
  LEFT JOIN airports AS dest_airports
         ON flights.dest = dest_airports.faa;
'''

query_database(query_string)

Note this: there are some flights for which we do not have full name. It happens that even though there are flights for certain destinations, *airports* table doesn't contain rows with information for these.

Anyway, what is even more interesting is that getting the result for this query takes a bit too long, right? Bear in mind we are joining *flights* table with over 300k rows, 2 times! This takes some time. 

Can we make it faster? Yes, but we need DBA to assist us with this one. We will not go into details here, but know that there is something called *Indexing* that can speed up query executions.

For the purpose of showing you the difference that can be achieved, we have created 2 additional tables that have been *indexed*. Look at the difference in query execution speed.

In [ ]:
query_string = '''
     SELECT flights.origin, 
            origin_airports.name AS origin_airport_name,
            flights.dest, 
            dest_airports.name AS dest_airport_name,
            flights.carrier
       FROM flights_i AS flights
  LEFT JOIN airports_i AS origin_airports
         ON flights.origin = origin_airports.faa 
  LEFT JOIN airports_i AS dest_airports
         ON flights.dest = dest_airports.faa;
'''

query_database(query_string)

#### Group By

Let's try aggregating data by grouping. Grouping in *SQL* is performed by using `GROUP BY` keyword. The result are groups on which we have to performe aggregations. Remember Pandas `groupby(...).agg(...)`. This is almost the same. 

Shall we go with the example:

In [ ]:
# just for quick overview of the flights data
df_flights.head()

Let's count number of distinct values in *carrier* column, and return name of the carrier and count.

We have already used `COUNT` function, but how can we use `MAX` on *carrier* column when it is of string type?

Remember how we compared strings in Python with `'aaa' > 'aab'`? 

Quck refresher:

In [ ]:
max(['a', 'aa', 'aab'])

It is the same in *SQL*. Couple of things to have in mind with next example is that:
 - by grouping on *carrier* we are creating set of groups for each of the carriers,
 - in each of these groups values in *carrier* column are the same,
 - calling `MAX` on this column returns carrier name. Do not let this confuse you.

In [ ]:
query_string = '''          
 SELECT MAX(carrier) AS carrier,
    COUNT(*) AS count
    FROM flights
GROUP BY carrier
ORDER BY count DESC
'''

query_database(query_string)

In [ ]:
# Panda's way :)

df_1 = df_flights['carrier'].value_counts().reset_index()
df_1

Which approach is simpler? It's for the debate. To each their own. 

Another example: Get the maximum distance and maximum air time for each flight route.

In [ ]:
df_flights.head()

In [ ]:
query_string = '''
SELECT 
     MAX(distance), 
     MAX(origin),
     MAX(dest),
     MAX(air_time)
FROM 
     flights 
GROUP BY 
     flights.origin, 
     flights.dest
'''


query_database(query_string)

In [ ]:
df_flights.groupby(['origin','dest']).agg({'air_time': 'max', 'distance': 'max'}).reset_index()

Let's see if the mean of departure delay per month varies through the year, for each of 3 NYC airports.

```sql
SELECT 
    MAX(a.name) AS origin,
    MAX(f.month) AS month,
    AVG(f.dep_delay) AS sum_dep_delay
FROM 
    flights_i AS f
LEFT JOIN 
    airports_i AS a
    ON f.origin = a.faa
GROUP BY 
    f.origin, 
    f.month
 ```

In [ ]:
query_string = '''
SELECT 
    MAX(a.name) AS origin,
    MAX(f.month) AS month,
    AVG(f.dep_delay) AS avg_dep_delay
FROM 
    flights_i AS f
LEFT JOIN airports_i AS a
    ON f.origin = a.faa
GROUP BY 
    f.origin, 
    f.month
'''

_df = query_database(query_string)
_df

In [ ]:
plt.figure(figsize=(16,3))
sns.barplot(data=_df,x ='month', y=_df['avg_dep_delay'],hue='origin')
sns.despine(top=True, right=True)
plt.legend(framealpha=.0)
plt.grid(alpha=.3)
plt.title('Monthly average of depature delays per each NYC airport.', size=20, pad=20);

Is the weather affecting the departure delays in the summer?

In [ ]:
df_weather.head()

In [ ]:
df_flights.head()
import numpy as np

We will answer this with good old Pandas data joining:
- "take" *flights* DataFame and left join *weather* on *origin* and *time_hour*. We have to take *time_hour* into consideration when performing join since weather is measured hourly,
- group by *origin* and *month* columns. As a result we get groups where both *origin* and *month* are the same. In essence, for each of 3 NYC airports we have flights per each month,
- then we take aggregations for *wind_speed*, *humid* and *temp* columns.

In [ ]:
_df = df_flights.merge(df_weather[['origin', 'wind_speed', 'humid', 'temp', 'time_hour']],
                       how='left', 
                       left_on=['origin', 'time_hour'], 
                       right_on=['origin', 'time_hour'])\
                .groupby(['origin', 'month']).agg(wind_speed=('wind_speed', np.mean), humid=('humid', np.mean), temp=('temp', np.mean))\
                .reset_index()

_df.head()

Now, the resulting DataFrame is in "wide" data format. Do you remember what "wide" format is?

In the "wide" format each repeated measurement for given subject is placed in the separate column. In our example, this is *wind_speed*, *humid* and *temp*.

In case we want to plot all of these, we would have to slice this DataFrame three times for each of these measurements, and plot each on y axis.

But, we can do this easier, by transforming from "wide" to "long" format.

In the "long" format, each mesurement gets its own row.

Here is how we can do it in Pandas:

In [ ]:
_df1 = pd.melt(_df, id_vars=['origin', 'month']).rename(columns={'variable': 'measurement'})

_df1

### Need a refresher for 

#### `pd.melt`

**pd.melt(dataFrame, id_vars=[],  value_vars = [])

in thise case above, .rename() has been used instead of value_vars .

I will try with value vars to achieve the same thing

In [ ]:
df1 = pd.melt(_df, id_vars=['origin','month'],value_vars=['wind_speed','temp']) # if value_vars are not specified,   uses all columns that are not set as value_id.
df1

Now, let's plot this using `seaborn`. 

So far we have seen that there is multiple ways of achieving the same thing, both in coding and plotting.

Now, we will use something different, that is probably very elegant.

It is called `FacetGrid`. This method gives us a way of creating grid of Axes. Something similar to what we got with `fig, axes = plt.subplots(nrows=..., ncols=...)` when we used `matplotlib`.

However, `FacetGrid` allows us to separate Axes in different grid rows or columns based on specified variable category. In this case it is separating in columns by each *measurement* category.

After creating `FacetGrid` we also have to perform plotting in each grid cell, by using `g.map` method. This method expects `seaborn` method for plotting, and arguments for "x", "y", and "hue" positional arguments. We used `sns.lineplot` for our example.

Here is how it looks like:

In [ ]:
g = sns.FacetGrid(_df1, col='measurement', height=3, aspect=1.5, sharey=False);
g.map(sns.lineplot, 'month', 'value', 'origin');
plt.legend(framealpha=.0);
plt.suptitle('Monthly measurements for each NYC airport.', size=15, y=1.10);

Apparently, it's not the wind.

Anyway, let's do the first plot of this analysis in Pandas way.

In [ ]:
_df = df_flights[['origin', 'dep_delay', 'month']].merge(df_airports[['faa', 'name']], 
                                                         how='left', 
                                                         left_on='origin',
                                                         right_on='faa')\
                                                  .groupby(['name', 'month']).agg(avg_dep_delay=('dep_delay', np.mean))\
                                                  .reset_index()

In [ ]:
_df

In [ ]:
plt.figure(figsize=(15, 3))
sns.barplot(x=_df.month, y=_df.avg_dep_delay, hue=_df.name);
sns.despine()
plt.legend(framealpha=.0);
plt.grid(alpha=.3)
plt.title('Monthly average of depature delays per each NYC airport.', size=20, pad=20);

Unfortunately, MariaDB doesn't have versatile set of aggregate functions. Check the list of available ones [here](https://mariadb.com/kb/en/aggregate-functions/).

#### Having

So far we have covered filtering by using `WHERE` keyword. 

Filtering using `WHERE` is as easy as in the next example where we retrieve rows where *temp* > 50 units:

In [ ]:
query_string = 'SELECT * FROM weather WHERE weather.temp > 50 LIMIT 10'
df12= query_database(query_string)
df12

But let's say you want to take the average wind speed per NYC airport and per month?

In [ ]:
query_string = '''
SELECT 
    MAX(origin),
    MAX(month),
    AVG(wind_speed)
FROM 
    weather
GROUP BY 
    origin, 
    month
'''

query_database(query_string)

But what about if you want to take only cases where average wind speed was over 10 units?

You would probably write something like this:

``` sql
SELECT 
     MAX(origin), 
     MAX(month),
     AVG(wind_speed)
FROM 
     weather
WHERE
     AVG(wind_speed) > 10      
GROUP BY 
     origin, 
     month
```

Right? Well, this would throw an error.

Let's see what are you trying to do. You want to filter out rows based on aggregation (`AVG`), and you put the condition in `WHERE`. 

Why doesn't this work? The answer has to do with order of query execution, which is a part where everyone trips over sooner or later. We will describe this in next section, but for now believe when we say that you need another keyword to achieve this.

This is `HAVING` keyword. By using it, you are able to filter out rows inside each group produced by `GROUP BY`. 

Here is an example: Retrieve monthly average wind speed per each NYC airport only if this average speed is over 10 units.

Here is how you would achieve this in 2 steps:

In [121]:
query_string= '''     
SELECT 
  MAX(origin),
  MAX(month),
  AVG(wind_speed)
 FROM weather
GROUP BY origin,month
'''

_df=query_database(query_string)
_df

   MAX(origin)  MAX(month)  AVG(wind_speed)
0          EWR           1         9.874685
1          EWR           2        12.202740
2          EWR           3        11.613262
3          EWR           4         9.628193
4          EWR           5         8.488549
5          EWR           6         9.551474
6          EWR           7         9.148779
7          EWR           8         7.623140
8          EWR           9         8.029852
9          EWR          10         8.324392
10         EWR          11        10.348973
11         EWR          12         8.932245
12         JFK           1        12.162287
13         JFK           2        13.382319
14         JFK           3        13.997021
15         JFK           4        12.543342
16         JFK           5        10.487122
17         JFK           6        11.103429
18         JFK           7        10.132137
19         JFK           8         9.756681
20         JFK           9         9.792818
21         JFK          10        10.436545
22         JFK          11        12.892610
23         JFK          12        11.119915
24         LGA           1        11.514004
25         LGA           2        12.435294
26         LGA           3        13.176586
27         LGA           4        11.125805
28         LGA           5         9.588287
29         LGA           6        10.134856
30         LGA           7         9.464894
31         LGA           8         8.458778
32         LGA           9         8.896169
33         LGA          10        10.341427
34         LGA          11        12.167925
35         LGA          12        10.339316

In [125]:
_df[_df['AVG(wind_speed)']>10].reset_index()

    index MAX(origin)  MAX(month)  AVG(wind_speed)
0       1         EWR           2        12.202740
1       2         EWR           3        11.613262
2      10         EWR          11        10.348973
3      12         JFK           1        12.162287
4      13         JFK           2        13.382319
5      14         JFK           3        13.997021
6      15         JFK           4        12.543342
7      16         JFK           5        10.487122
8      17         JFK           6        11.103429
9      18         JFK           7        10.132137
10     21         JFK          10        10.436545
11     22         JFK          11        12.892610
12     23         JFK          12        11.119915
13     24         LGA           1        11.514004
14     25         LGA           2        12.435294
15     26         LGA           3        13.176586
16     27         LGA           4        11.125805
17     29         LGA           6        10.134856
18     33         LGA          10        10.341427
19     34         LGA          11        12.167925
20     35         LGA          12        10.339316

What is the SQL HAVING Clause?
The HAVING clause is used to filter the result of the GROUP BY statement based on the specified conditions. It allows filtering grouped data using Boolean conditions (AND, OR). It was introduced because the WHERE clause cannot be used with aggregate functions. Similar to WHERE clause, it helps apply conditions but specifically works with grouped data. When we need to filter aggregated results, the HAVING clause is the appropriate choice.

Key Features of the HAVING Clause

Used to filter grouped data based on aggregate functions.
Works with Boolean conditions (AND, OR                                                                   
Cannot be used without GROUP BY unless an aggregate function is present.
Must be placed after the GROUP BY clause and before the ORDER BY clause (if used).
Helps generate summary reports from large datasets.

#### ****Syntax:**

- SELECT column_name, AGGREGATE_FUNCTION(column_name)

- FROM table_name

- GROUP BY column_name

- HAVING `condition`;

And now how it is done by using `HAVING` keyword:

In [131]:
query_string = '''
SELECT 
     MAX(origin), 
     MAX(month),
     AVG(wind_speed)
FROM 
     weather
GROUP BY 
     origin, 
     month
HAVING  
     AVG(wind_speed) > 10     
'''

query_database(query_string)

   MAX(origin)  MAX(month)  AVG(wind_speed)
0          EWR           2        12.202740
1          EWR           3        11.613262
2          EWR          11        10.348973
3          JFK           1        12.162287
4          JFK           2        13.382319
5          JFK           3        13.997021
6          JFK           4        12.543342
7          JFK           5        10.487122
8          JFK           6        11.103429
9          JFK           7        10.132137
10         JFK          10        10.436545
11         JFK          11        12.892610
12         JFK          12        11.119915
13         LGA           1        11.514004
14         LGA           2        12.435294
15         LGA           3        13.176586
16         LGA           4        11.125805
17         LGA           6        10.134856
18         LGA          10        10.341427
19         LGA          11        12.167925
20         LGA          12        10.339316

Cases where you will use `HAVING` may not appear that often, but it is good to at least know that it exists and what is its purpose.

Now, we go to the finishing section of the session, and it touches upon the query execution order that was mentioned.

### SQL Execution Order

As already mentioned, this concept is crucial to get under your belt, to be able to fully master even the simpler queries.

So far we have smoothly went through the examples without mentioning this, but this surely plays a significant role in understanding how data is processed on the RDBMS side.

Here is the query execution order:

|order|clause|function|
|-----|------|--------|
|1|FROM|choose and join tables to get the data|
|2|WHERE|filter the rows based on conditions|
|3|GROUP BY|aggregate the data|
|4|HAVING|filter rows in groups|
|5|SELECT|return the final data|
|6|ORDER BY|sorts the final data|
|7|LIMIT|limits the returned data to a row count|


You will notice that this order is totally different from the order you write *SQL* query. Exactly! And precisely because of that you could end up with the bad query that will not execute. 

For example, here is the query that will not run:

``` sql 
SELECT 
     MAX(origin), 
     MAX(month)
FROM 
     weather
WHERE
     AVG(wind_speed) > 10
GROUP BY 
     origin, 
     month
 ```

 Why? Because, we are trying to access aggregated value of *wind_speed* **before** `GROUP BY` part.

 Another example. 
 
 Retrieve flights that that achieved speed over 550.0 mph, while listing out the engine and type of the aircraft.

```sql
SELECT 
    f.carrier,
    f.air_time, 
    f.distance, 
    f.distance / (f.air_time / 60) as speed,
    p.engine,
    p.type
FROM 
    flights as f
LEFT JOIN 
    planes as p
ON 
    f.tailnum = p.tailnum
WHERE 
    speed > 550.0
```

This query won't run. Why? Because we are referencing column *speed* in `WHERE` part of the query, but it is being defined in the `SELECT` part.

However, knowing the order of *SQL* execution, you will be able to modify query and make it work.

Here is how:

In [133]:
query_string = '''
SELECT 
    f.carrier,
    f.air_time, 
    f.distance, 
    f.distance / (f.air_time / 60) as speed,
    p.engine,
    p.type
FROM 
    flights as f
LEFT JOIN 
    planes as p
ON 
    f.tailnum = p.tailnum
WHERE 
    (distance / (air_time / 60)) > 550.0
'''

query_database(query=query_string)

   carrier  air_time  distance       speed     engine                     type
0       EV      62.0       569  550.645161  Turbo-fan  Fixed wing multi engine
1       EV      62.0       569  550.645161  Turbo-fan  Fixed wing multi engine
2       EV      70.0       748  641.142857  Turbo-fan  Fixed wing multi engine
3       EV      70.0       748  641.142857  Turbo-fan  Fixed wing multi engine
4       EV      55.0       594  648.000000  Turbo-fan  Fixed wing multi engine
..     ...       ...       ...         ...        ...                      ...
77      AA     173.0      1598  554.219653       None                     None
78      AA     174.0      1598  551.034483       None                     None
79      AA     175.0      1623  556.457143       None                     None
80      AA     173.0      1598  554.219653       None                     None
81      AA     174.0      1598  551.034483       None                     None

[82 rows x 6 columns]

 Have in mind the "order of execution" table when writing your *SQL* queries. 
 
 It will help you a lot while navigating through query writing.

 Here is a way to memorize writing and execution order:

|Keyword|Writing|Execution|
|-------|-------|---------|
|**S**ELECT|**S**ome|**F**rodo|
|**F**ROM|**F**rench|**W**atches|
|**W**HERE|**W**aiters|**G**andalf|
|**G**ROUP BY|**G**row|**H**aving|
|**H**AVING|**H**ealty|**S**moke|
|**O**RDER BY|**O**ranges|**O**n|
|**L**IMIT|**L**uckily|**L**og|

That's it for this session. We hope you enjoyed this *SQL* adventure.

### A highly recommended To Do
- [Online SQL practicing web application](https://www.sql-practice.com/).
- [Mutating Joins to Combine Data Sources](https://bookdown.org/pdr_higgins/rmrwr/mutating-joins-to-combine-data-sources.html)
- [A Look Into SQL’s Order Of Execution](https://towardsdatascience.com/a-look-into-sqls-order-of-execution-d0b81e361c66)
- [Having Clause](https://www.sqlcourse.com/advanced-course/having-clause/)

***

DataKolektiv, 2022/23.

[hello@datakolektiv.com](mailto:goran.milovanovic@datakolektiv.com)

![](../img/DK_Logo_100.png)

<font size=1>License: [GPLv3](https://www.gnu.org/licenses/gpl-3.0.txt) This Notebook is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version. This Notebook is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details. You should have received a copy of the GNU General Public License along with this Notebook. If not, see http://www.gnu.org/licenses/.</font>